[
  {
    "title": "Routine Scheduler",
    "motto": "My personal MERN project",
    "status": true,
    "desc": "Routine Scheduler is designed with ease of use and time management in mind. Users can create task blocks to represent 30 minute intervals, and edit these blocks at will. This site also tracks users statistics, showcasing progress and enabling users to track their consistency.",
    "contribution": "I created Routine Scheduler as a way to better manage my time as I felt no sites had such an emphasis on routines. I was responsible for creating the front-end and server, the UX and UI, and implementing a new technology. ",
    "techstack": ["React", "Tailwind", "Mongo", "Mongoose", "Express","Redux", "Node", "Next"],
    "pictures": ["/images/routineAppScreenshot.png", "/images/routineScreenshot.png"],
    "link": "https://routine-scheduler.vercel.app/"
  },
  {
    "title": "Tyr's Vault",
    "motto": "Express.js, MySQL, and REST API's ",
    "status": true,
    "desc": "Tyr's Vault is a gaming hub designed to allow users to showcase their games, add friends, and discover new titles. Third party API's provide game related data, images, and powers the search function. Adding your favorite games is very simple, and is displayed on the friends page for all users to see. Make an account and explore what Tyr's Vault has to offer!",
    "contribution": "This project was my first major collaborative effort, and I was responsible for the entire front-end. I decided to use Fomantic UI for the CSS framework, as it was easy to use, had pre-built components, and looked good. I was also responsible for creating the REST API's that would show the relevent data, and creating the JS logic to handle different events. ",
    "techstack": [
      "JavaScript",
      "Fomantic",
      "MySQL",
      "Sequelize",
      "Express",
      "Node"
    ],
    "pictures": ["/images/tyrsvault.png", "/images/tyrsvaultsecond.png"],
    "link": "https://tyrs-vault.herokuapp.com/login"
  },
  {
    "title": "Tech Blog",
    "motto": "All about the SQL back-end",
    "status": true,
    "desc": "Tech-Blog is a site designed for users to post and share coding related subject matter. Users can leave and delete comments, explore the feed, and edit their own posts. The site works on mobile, and is very simple to use. The dashboard only works if logged in, preventing users from posting without an account.",
    "contribution": "This website was one of the first full stack projects required by in my boot camp, with MySQL and the sequelize ORM library being the main focus point of the project. I was responsible for the UI and UX, as well as the Node.js server, and all data storage.",
    "techstack": [
      "JavaScript",
      "Fomantic",
      "MySQL",
      "Sequelize",
      "Express",
      "Node"
    ],
    "pictures": ["/images/techblog.png", "/images/techblogsecond.png"],
    "link": "https://carree-tech-blog-806f7c387358.herokuapp.com/"
  },
  {
    "title": "My Portfolio",
    "motto": "Fifth times the charm",
    "status": true,
    "desc": "A way for me to consolidate all of my work, and showcase my web developer skills. ",
    "contribution": "After many iterations as I learned and developed new skills I&apos;ve finally made a portfolio I love. Having complete control over the style and direction of a website can be frusterating when it never quite lives up to your standards, but I believe I found the perfect balance of color pallete and aesthetics and love how it turned out.",
    "techstack": [
      "React",
      "Tailwind",
      "Next"
    ],
    "pictures": ["/images/portfolioScreenshot.png", "https://upcdn.io/FW25bUs/raw/uploads/2023/09/12/newestPortfolioScreenshot-5Qsq.PNG"],
    "link": "/"
  },
  {
    "title": "Crusaders",
    "motto": "Mastering React and Tailwind CSS",
    "status": true,
    "desc": "Crusaders is a gorgeous social media website designed with user experience in mind. The site works on both desktop and mobile, and is not only intuitive and simplistic, but also blazingly fast. Users can post pictures, comment on posts, like posts, and follow other users. Next.js dynamic routing, server-side rendering, and GraphQL queries allows for near instant navigation between pages, even with data being moved frequently. Tailor the site to your liking with light mode and dark mode, the site will remember your preferences.",
    "contribution": "I designed the UI and UX, created the React components, and worked with my teammates to make data integration as smooth as possible. I used Next.js and Tailwind CSS.",
    "techstack": [
      "React",
      "Tailwind",
      "Mongo",
      "Mongoose",
      "GraphQL",
      "Node",
      "Next"
    ],
    "pictures": ["/images/crusadersSocial.png", "/images/crusadersSocialSecond.png"],
    "link": "https://crusaders-media-e9469ade02da.herokuapp.com/"
  }
]
